#算数ゲーム
import random
import time

#質問と答えの記入
tashizan2 = [["2+9=","11"],["3+8=","11"],["3+9=","12"],["4+7=","11"],
["4+8=","12"],["4+9=","13"],["5+6=","11"],["5+7=","12"],
["5+8=","13"],["5+9=","14"],["6+5=","11"],["6+6=","12"],
["6+7=","13"],["6+8=","14"],["6+9=","15"],["7+4=","11"],
["7+5=","12"],["7+6=","13"],["7+7=","14"],["7+8=","15"],
["7+9=","16"],["8+3=","11"],["8+4=","12"],["8+5=","13"],
["8+6=","14"],["8+7=","15"],["8+8=","16"],["8+9=","17"],
["9+2=","11"],["9+3=","12"],["9+4=","13"],["9+5=","14"],
["9+6=","15"],["9+7=","16"],["9+8=","17"],["9+9=","18"]]

hikizan2 = [["11-2=","9"],["11-3=","8"],["11-4=","7"],["11-5=","6"],
["11-6=","5"],["11-7=","4"],["11-8=","3"],["11-9=","2"],
["12-3=","9"],["12-4=","8"],["12-5=","7"],["12-6=","6"],
["12-7=","5"],["12-8=","4"],["12-9=","3"],["13-4=","9"],
["13-5=","8"],["13-6=","7"],["13-7=","6"],["13-8=","5"],
["13-9=","4"],["14-5=","9"],["14-6=","8"],["14-7=","7"],
["14-8=","6"],["14-9=","5"],["15-6=","9"],["15-7=","8"],
["15-8=","7"],["15-9=","6"],["16-7=","9"],["16-8=","8"],
["16-9=","7"],["17-8=","9"],["17-9=","8"],["18-9=","9"]]

#質問選択
print("クイ～ズクイズ、何のクイズ？")
print("たしざん２： 1\nひきざん２： 2")
quizchoice=input("クイズをえらんでください。 ")
while quizchoice!="1" and quizchoice!="2":
    quizchoice=input("もう１かい、クイズをえらんでください。 ")
    
    
if quizchoice=="1":
    questionlist=tashizan2
    print("たしざんのクイズやりましょう～")
else:
    questionlist=hikizan2
    print("ひきざんのクイズやりましょう～")

    
#順番をランダム可
random.shuffle(questionlist)

start_time = time.time()
mistakecount=0
tempmistake=0

#質問・答え確認
for i in questionlist:
    question=(i[0])
    answer=(i[1])
    quess=input(question)
    while quess != answer:
        print("☓")
        quess=input(question)
        tempmistake=tempmistake+1
    else:
        print("◯")
        if tempmistake >= 1:
            mistakecount=mistakecount+1
            tempmistake=0

#時間計算
seconds=int(time.time() - start_time)

#結果発表
print("おわりました、おめでとうございます！")
print("かかった時間：",int(seconds/60),"分",seconds%60,"秒")
print("まちがえたしつもん：",mistakecount,"件")
print("明日もがんばりましょう～")


